In [2]:
import pandas as pd
import numpy as np

In [57]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}
print(type(items))

<class 'dict'>

In [58]:
shopping_carts = pd.DataFrame(items)
shopping_carts
# here keys become columns and the index labels of pandas series become the rows
# also the data is sorted alphabetically in the rows

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [59]:
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [60]:
shopping_carts.shape

(5, 2)

In [61]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [62]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [63]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [64]:
shopping_carts.size

10

In [65]:
shopping_carts.ndim # specifies if it's an 1 dimensional array or an 2 dimensional array

2

In [66]:
# We Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])

# We display bob_shopping_cart
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [67]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [68]:
alice_sel_shopping_cart = pd.DataFrame(items, index=['glasses', 'bike'], columns=['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [69]:
data = {'Integers': [1, 2, 3],
       'Floats': [4.5, 8.2, 9.6]}

df = pd.DataFrame(data, index=['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [70]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]
store_items =pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [71]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [72]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [73]:
store_items.loc[['store 1']]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [74]:
store_items['bikes']['store 2']
# here, make a note that the column label such as 'bikes' always comes first and then the row 'store 2'
# otherwise you'll get an error

15

In [75]:
store_items['shirts'] = [15, 2] # adding a new column
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [76]:
store_items['suits'] = store_items['shirts'] + store_items['pants'] # add new column via arithmetic operations
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [77]:
# add new row
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [78]:
# add the above new_store as a new row by using the append function
store_items =store_items.append(new_store)
store_items

C:\Users\roopa\Anaconda3\lib\site-packages\pandas\core\frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

In [79]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  pants  shirts  suits  watches  new_watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

In [80]:
store_items.insert(5, 'shoes', [8, 5, 0])
# first argument 5 is the location where the new column has to be inserted i.e., at the index 5
# second argument is the label for the new column being inserted
# third argument is the data to fit the 3 rows for this new column added
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1     20      NaN     30    15.0   45.0      8       35          NaN
store 2     15     50.0      5     2.0    7.0      5       10         10.0
store 3     20      4.0     30     NaN    NaN      0       35         35.0

In [81]:
# we can delete row and columns from a DataFrame
# use a pop method to delete columns
# while a drop method can be used to delete both rows and columns by using axis keyword
store_items.pop('new_watches')
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches
store 1     20      NaN     30    15.0   45.0      8       35
store 2     15     50.0      5     2.0    7.0      5       10
store 3     20      4.0     30     NaN    NaN      0       35

In [83]:
store_items = store_items.drop(['watches', 'shoes'], axis=1)
store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    15.0   45.0
store 2     15     50.0      5     2.0    7.0
store 3     20      4.0     30     NaN    NaN

In [84]:
store_items = store_items.drop(['store 1', 'store 2'], axis=0)
store_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

In [85]:
# changing the label names
store_items = store_items.rename(columns={'bikes': 'hats'}) # renaming teh column 'bikes' to 'hats'
store_items

         hats  glasses  pants  shirts  suits
store 3    20      4.0     30     NaN    NaN

In [87]:
store_items = store_items.rename(index={'store 3': 'last_store'})
store_items

            hats  glasses  pants  shirts  suits
last_store    20      4.0     30     NaN    NaN

In [88]:
store_items = store_items.set_index('pants') # here, we're using the value in the 'pants' column as the row index label
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

In [90]:
# Since we will be working with ratings, we will set the precision of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

In [104]:
# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = {'Book Title': books, 'Author': authors, 'User 1': user_1, 'User 2': user_2, 'User 3': user_3, 'User 4': user_4}

In [105]:
# Use the dictionary to create a Pandas DataFrame
book_ratings = pd.DataFrame(dat)
book_ratings

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     NaN     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     NaN     4.0
3     The Time Machine          H. G. Wells     NaN     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     NaN     NaN     NaN     4.2

In [106]:
# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3',
# 'User 4' and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. HINT: you can use the fillna()
# function with the keyword inplace = True, to do this. Write your code below:

book_ratings.fillna(book_ratings.mean(axis=0), inplace=True)
book_ratings

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     2.9     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     2.8     4.0
3     The Time Machine          H. G. Wells     2.9     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     2.9     3.5     2.8     4.2

In [111]:
best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values
best_rated

array(['Great Expectations', 'The Time Machine'], dtype=object)

In [6]:
dates = pd.date_range('2000-01-01', '2016-12-31')
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10',
               ...
               '2016-12-22', '2016-12-23', '2016-12-24', '2016-12-25',
               '2016-12-26', '2016-12-27', '2016-12-28', '2016-12-29',
               '2016-12-30', '2016-12-31'],
              dtype='datetime64[ns]', length=6210, freq='D')